forbidden-knowledge.org
#+Title: Cool Python Notes
#+Subtitle: Also known as ``Forbidden Knowledge''
#+Author: uocsclub

Note that in all of the following, I'm talking about CPython.

Also note that this is going to be presented in the form of a lecture
and none of the material has been reviewed. I think.

