forbidden-knowledge.tex
% Created 2021-09-15 Wed 13:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{uocsclub}
\date{\today}
\title{Cool Python Notes\\\medskip
\large Also known as ``Forbidden Knowledge''}
\hypersetup{
 pdfauthor={uocsclub},
 pdftitle={Cool Python Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

Note that in all of the following, I'm talking about CPython.

Also note that this is going to be presented in the form of a lecture
and none of the material has been reviewed. I think.
