forbidden-knowledge.org
* Function argument wizardry
  What is the ~*~ operator in Python?

  It's multiplication.

  Hahaha jk it's unpacking of an iterable in a function argument
  list. Let's play a koan game.

  #+begin_src python
    >>> def args(*args):
    ...     return args
  #+end_src
  This seems like a pretty simple function, but this is not the
  case. This function is a looking glass through which we can observe
  the functioning of python.

  What does the star syntax mean in the argument?

  It means to take the arguments passed to the function, put them in a
  tuple, and make that tuple be ~args~.
  #+begin_src python
    >>> args(1, 2, 3)
    (1, 2, 3)
  #+end_src

  The ~*~ operator isn't only used at function definition time, it has
  semantics at function call time too.
  #+begin_src python
    >>> args(*[1, 2, 3])
    (1, 2, 3)
  #+end_src
  In this case, it means to ``unpack'' what it is applied to (it's a
  prefix unary operator). It's a prefix (comes before its operand)
  unary (it only takes
  one operand) operator.

  This is pretty cool, but how does it behave when there are other
  arguments in play?
  #+begin_src python
    >>> args(1, *[2, 3, 4])
    (1, 2, 3, 4)
  #+end_src
  It seems to unpack each of its elements in place, as if the
  structure over which we're iterating did not even exist (and to the
  function we're passing this to, it does not).

  Let's do some more tests to confirm that this is actually how it works.
  #+begin_src python
    >>> args(1, *[2, 3, 4], 5)
    (1, 2, 3, 4, 5)

    >>> args(1, *[2, 3, 4], *zip([1, 2, 3], [4,5,6]))
    (1, 2, 3, 4, (1, 4), (2, 5), (3, 6))
  #+end_src
  And indeed, this is what it does.

  This ~zip~ example merits further examination. What does ~zip~ do?
  ~zip~ takes an arbitrary number of iterable collections, and
  iterates over them concurrently, creating tuples with an element
  from each collection each iteration. Let's look at an example.
  #+begin_src python
    >>> zip([1,2,3], [4,5,6])
    <zip object at 0x7f2d8cdfadc0>
  #+end_src
  What's this???? a ~<zip object..~? Haha! I've tricked you into
  realizing that you can unpack /any generator/ with ~*~ in argument
  lists.
  #+begin_src python
    >>> args(1, *[2, 3, 4], *zip([1, 2, 3], [4,5,6]))
    (1, 2, 3, 4, (1, 4), (2, 5), (3, 6))
  #+end_src

  Let's actually look carefully at what this generator contains:
  #+begin_src python
    >>> list(zip([1,2,3], [4,5,6]))
    [(1, 4), (2, 5), (3, 6)]
  #+end_src
  You can see that it starts with the first element from each
  collection, 1 and 4, then the second, 2 and 5, then the third, 3 and 6.

  Think you understand argument packing and unpacking? Let's implement
  zip.
  #+begin_src python
    def zip1(*args):
        for tup in zip(*args):
            yield tup
  #+end_src
  Hah! You, in your starry-eyed idealism, expected me to give you a real
  example, but I've fooled you once more, instead again showing you
  how packing and unpacking are strangely symmetrical. In some sense,
  they are opposites. Unpacking goes from a data structure to
  arguments, and packing goes from arguments to a data structure. Not
  so surprising that they both use the same unary operator, now is it?

  Let's go a whole way around the loop:
  #+begin_src python
    def identity_function(*args):
        return tuple(zip(*zip(*args)))

    >>> identity_function([1,2,3],[4,5,6])
    ((1, 2, 3), (4, 5, 6))
  #+end_src

  I'm not actually going to write zip. If you want to be enlightened
  about the limitations of python, go try and write a clean zip
  implementation using the features I've just shown you.

  Getting back to the matter at hand, I think I saw someone somewhere
  using ~**~ in an argument list...
  #+begin_src python
    >>> args(**list(zip([1,2,3],[4,5,6])))
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: __main__.args() argument after ** must be a mapping, not list
  #+end_src
  Oof. Looks like I need a mapping. 
  #+begin_src python
    >>> args(**{1: 2, 3: 4})
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: keywords must be strings
  #+end_src
  Oof. Looks like I need strings. Wait, what does it mean by keyword? 
  #+begin_src python
    >>> args(**{'a': 2, 'b': 4})
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: args() got an unexpected keyword argument 'a'
  #+end_src
  It's taking the dictionary, and passing it as keyword arguments!
  We'll get to this later.
  
  Let's make ~args~ a bit more interesting, sharpening our looking
  glass...
  #+begin_src python
    >>> def args(first, second, *rest):
    ...     print('first', first)
    ...     print('second', second)
    ...     print('rest', rest)
  #+end_src
  We now have another definition of args, one with a combination of
  positional args and unpacking.

  Using unpacking in this way takes the ``rest'' of the arguments passed
  to the function and squashes them into a tuple.
  #+begin_src python
    >>> args(1, 2, 3, 4, 5)
    first 1
    second 2
    rest (3, 4, 5)
  #+end_src

  Okay, let's combine this with the keyword arg passing through a
  dictionary that we had earlier.
  #+begin_src python
    >>> args(**dict(first=0, second=1, rest=(1,2,3,4)))
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: args() got an unexpected keyword argument 'rest'
  #+end_src
  Oops, looks like we can't refer to an unpacking argument in keyword
  arguments.
  #+begin_src python
    >>> args(**dict(first=0, second=1))
    first 0
    second 1
    rest ()
  #+end_src
  Ooh, but we can definitely pass to normal arguments this way. What
  about if we try to pass more arguments afterwards to fill in ~rest~?
  #+begin_src python
    >>> args(**dict(first=0, second=1), 'wowza')
      File "<stdin>", line 1
        args(**dict(first=0, second=1), 'wowza')
                                               ^
    SyntaxError: positional argument follows keyword argument unpacking
  #+end_src
  No dice. But, the astute among you might be thinking to
  yourselves that this seems a lot like what happens when you try to
  pass an argument after a keyword argument.
  #+begin_src python
    >>> args(first=1, second=2, 'wowza')
      File "<stdin>", line 1
        args(first=1, second=2, 'wowza')
                                       ^
    SyntaxError: positional argument follows keyword argument
  #+end_src
  This gives a very very very strong clue about how this is all
  implemented under the hood...
  #+begin_src python
    >>> args(first=1, second=2)
    first 1
    second 2
    rest ()
    >>> args(**{'first':1, 'second':2})
    first 1
    second 2
    rest ()
    >>> args(**dict(first=1, second=2))
    first 1
    second 2
    rest ()
  #+end_src
  What about if we pass an argument before the dictionary?
  #+begin_src python
    >>> args('wowza', **dict(first=0, second=1, third=3))
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: args() got multiple values for argument 'first'
    >>> args(**dict(first=0, second=1, third=3))
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: args() got an unexpected keyword argument 'third'
  #+end_src

  Okay, now that we're comfortable with unpacking dictionaries, let's
  pack them.
  #+begin_src python
    >>> def args(first, second, **rest):
    ...     print('first', first)
    ...     print('second', second)
    ...     print('rest', rest)
  #+end_src
  Can you guess what the semantics of this will be?
  #+begin_src python
    >>> args(1, 2, 3)
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: args() takes 2 positional arguments but 3 were given
    >>> args(1, 2, one=1, two=2)
    first 1
    second 2
    rest {'one': 1, 'two': 2}
  #+end_src
  Okay, this is getting epic. What about if we pass first and second
  as keyword arguments?
  #+begin_src python
    >>> args(first=1, second=2)
    first 1
    second 2
    rest {}
    >>> args(one=1, two=2, first=1, second=2)
    first 1
    second 2
    rest {'one': 1, 'two': 2}
  #+end_src
  So you're telling me the order of keyword arguments doesn't matter???

  One more thing to blow your mind...
  
  #+begin_src python
    def args(*args, **kwargs):
        print("args", args)
        print("kwargs", kwargs)
  #+end_src

  You can use both simultaneously. 
  #+begin_src python
    >>> args(1, 2, 3, test=4, five=5)
    args (1, 2, 3)
    kwargs {'test': 4, 'five': 5}
  #+end_src
  
