forbidden-knowledge.tex

\section{Food for thought about objects}
\label{sec:orgd3e77b6}
Here's some food for thought\ldots{}

So, you're saying that there's a direct correspondence between
keyword arguments and string-keyed dictionaries\ldots{} And, note the
syntax similarities\ldots{}

Did you know that short strings are interned in Python? This means
that when you use the same string multiple times, you always refer
to the exact same object and comparison and hashing can then be done
by pointer. Python string interning is done with an internal global
dictionary.

Did you know that in Python, the names of functions, variables,
arguments, etc, are all stored as the same kind of string that you
use in the language, and are all interned?

This means that short strings in Python have some extremely valuable
properties. Their equality comparison is constant time. Their
hashing is constant time. Think about what that means for the
implementation of the Python language constructs.

Let's take a look at \texttt{args}.
\begin{verbatim}
>>> args
<function args at 0x7f2d8cc8aca0>
\end{verbatim}
Yes, it's a function, but what is a function?
\begin{verbatim}
>>> dir(args)
['__annotations__', '__call__', '__class__', '__closure__',
 '__code__', '__defaults__', '__delattr__', '__dict__', '__dir__',
 '__doc__', '__eq__', '__format__', '__ge__', '__get__',
 '__getattribute__', '__globals__', '__gt__', '__hash__', '__init__',
 '__init_subclass__', '__kwdefaults__', '__le__', '__lt__',
 '__module__', '__name__', '__ne__', '__new__', '__qualname__',
 '__reduce__', '__reduce_ex__', '__repr__', '__setattr__',
 '__sizeof__', '__str__', '__subclasshook__']
\end{verbatim}
What's this? These are all internal functions which implement \texttt{args}'
functionality.
\begin{verbatim}
>>> args.__call__
<method-wrapper '__call__' of function object at 0x7f2d8cc8aca0>
>>> args.__call__(1, 2)
first 1
second 2
rest ()
\end{verbatim}
Isn't that interesting\ldots{}

What about an object?
\begin{verbatim}
>>> class Thing():
...     pass
... 
>>> Thing()
<__main__.Thing object at 0x7f2d8cecab80>
>>> 
>>> t = Thing()
>>> dir(t)
['__class__', '__delattr__', '__dict__', '__dir__', '__doc__',
 '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__',
 '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__',
 '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__',
 '__repr__', '__setattr__', '__sizeof__', '__str__',
 '__subclasshook__', '__weakref__']
\end{verbatim}
Let's look at the most interesting element here\ldots{}
\begin{verbatim}
>>> t.__dict__
{}
>>> t.__dict__['args'] = args
>>> t.__dict__
{'args': <function args at 0x7f2d8cc8aca0>}
\end{verbatim}
Can you guess what comes next?
\begin{verbatim}
>>> t.args
<function args at 0x7f2d8cc8aca0>
>>> t.args(1, 2, 3, 4, 5)
first 1
second 2
rest (3, 4, 5)
>>> 
\end{verbatim}
What does this tell us about the implementation of Python's object
system?

Can you hear the meta-object programming calling to you? Can you
smell the sweet scent of metaprogramming?

If you don't hear meta-object programming calling to you, please
refer to the following code taken from Peter Norvig's blog:
\begin{verbatim}
class Struct:
    "A structure that can have any fields defined."
    def __init__(self, **entries): self.__dict__.update(entries)

>>> options = Struct(answer=42, linelen=80, font='courier')
>>> options.answer
42
>>> options.answer = 'plastics'
>>> vars(options)
{'answer': 'plastics', 'font': 'courier', 'linelen': 80}
\end{verbatim}

Now, think about what this means for the previous section. How do
you think argument passing is actually implemented under the hood?
How do you think packing and unpacking is done?
