forbidden-knowledge.org
* Function decorators (AKA functional programming from first principles)
  In Python, there exists something very cool called a function
  decorator.

  It looks like this:
  #+begin_src python
    @function_decorator
    def f(something):
        return something
  #+end_src

  What is it? It's something that can change the way your functions
  behave without changing their bodies.

  As for how it's actually implemented, it's a function which takes as
  its argument another function, and returns a new function. The
  original function is then defined as the new function returned by
  the decorator.

  What's the do-nothing decorator?
  #+begin_src python
    def do_nothing_dec(func):
        return func
  #+end_src
  And, so, we can decorate a function by putting ~@<decorator-name>~
  before the function definition when defining it. It works in the
  shell, too.
  #+begin_src python
    @do_nothing_dec
    def f():
        return 5
    
    >>> f()
    5
  #+end_src

  Cool. Let's make it even cooler. 
  #+begin_src python
    def add_five(func):
        return lambda: func() + 5
  #+end_src
  Can you guess what this does to a function it decorates?
  #+begin_src python
    @add_five
    def f():
        return 5

    >>> f()
    10
  #+end_src

  But wait, I saw somewhere (I can't remember where) that decorators
  can take arguments! Let's add that in.
  #+begin_src python
    def add_some(func, num):
        return lambda: func() + num 
  #+end_src
  And, here we go!
  #+begin_src python
    >>> @add_some(4)
    ... def f():
    ...     return 5
    ... 
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: add_some() missing 1 required positional argument: 'num'
  #+end_src

  Huh? It didn't work. But, we know that ~add_some~ works as we're
  intending, it does return a function which behaves as expected.
  #+begin_src python
    >>> f()
    10
    >>> add_some(f, 4)
    <function add_some.<locals>.<lambda> at 0x7f2d8cc8ae50>
    >>> add_some(f, 4)()
    14
  #+end_src

  So, how is this supposed to work? We know that decorators can only
  take one argument, the function they're applied to.

  How do we pass arguments to a decorator?

  (Pause for dramatic effect)

  We create a function that returns a decorator.
  #+begin_src python
    def add_some(num):
        def add_other(func):
            return lambda: func() + num 
        return add_other
  #+end_src
  Note how ~add_other~ refers to ~num~, which is not in its body.
  This kind of function (which refers to variables outside of its
  body) is called a *closure* (and is one of the most important things
  you could learn, period. The power of closures is incredible.).
  #+begin_src python
    >>> @add_some(5)
    ... def f():
    ...     return 3
    ... 
    >>> f()
    8
  #+end_src
  You can read this as ~@(add_some(5))~. It's evaluating ~add_some(5)~
  before trying to use the result as a decorator.
  
  What can you use it for? Let's say we had some complicated problem
  with our recursive program that we couldn't figure out how to
  solve. Every time you call it, it loops infinitely!

  The boring way to debug that is adding print statements. The /m e t
  a/ way of doing it is with decorators:
  #+begin_src python
    def trace(func):
        def traced_fun(*args, **kwargs):
            print(f"Call -- {args}, {kwargs}")
            return func(*args, *kwargs)
        return traced_fun
  #+end_src
  So, let's annotate the function that we couldn't debug.
  #+begin_src python
    >>> @trace
    ... def f(a):
    ...     if a == 0:
    ...             return "you're done!"
    ...     else:
    ...             return f(a - 1)
  #+end_src
  And the veil is removed from your eyes in real time!
  #+begin_src python
    >>> f(-1)
    Call -- (-1,), {}
    Call -- (-2,), {}
    Call -- (-3,), {}
    Call -- (-4,), {}
    Call -- (-5,), {}
    Call -- (-6,), {}
    Call -- (-7,), {}
    Call -- (-8,), {}
    Call -- (-9,), {}
    ...
    ...
  #+end_src
  Aha!
  #+begin_src python
    >>> f(5)
    Call -- (5,), {}
    Call -- (4,), {}
    Call -- (3,), {}
    Call -- (2,), {}
    Call -- (1,), {}
    Call -- (0,), {}
    "you're done!"
  #+end_src

  Alright, so our /m e t a  t r a c e r/ seems to work as
  expected. But, you know what they say about leaky
  abstractions. Sometimes things are not always what they seem.

  #+begin_src python
    >>> f.__name__
    'traced_fun'
  #+end_src
  What is this? ~f~'s name is 'traced-fun'? That can't be right. Let's
  cook up some more /m e t a - o b j e c t/ goodness.

  Let's say we want the ~traced_fun~ we're returning to have some of
  the same attributes as the original functon that's passed. Let's
  look at ~f~.
  #+begin_src python
    >>> dir(f)
    ['__annotations__', '__call__', '__class__', '__closure__',
     '__code__', '__defaults__', '__delattr__', '__dict__', '__dir__',
     '__doc__', '__eq__', '__format__', '__ge__', '__get__',
     '__getattribute__', '__globals__', '__gt__', '__hash__', '__init__',
     '__init_subclass__', '__kwdefaults__', '__le__', '__lt__',
     '__module__', '__name__', '__ne__', '__new__', '__qualname__',
     '__reduce__', '__reduce_ex__', '__repr__', '__setattr__',
     '__sizeof__', '__str__', '__subclasshook__']
  #+end_src
  Looks to me like we'd want ~__module__~, ~__name__~, ~__qualname__~,
  ~__doc__~, and ~__annotations__~ to stay the same after wrapping.

  How shall we implement this, I hear you ask? Why, /m e t a - f u n c
  t i o n - d e c o r a t o r s/, of course!
  #+begin_src python
    def wraps(wrapped):
        def wrap(wrapper):
            for attr in ('__module__', '__name__', '__qualname__',
                         '__doc__', '__annotations__'):
                try:
                    val = getattr(wrapped, attr)
                except AttributeError:
                    pass
                else:
                    setattr(wrapper, attr, val)
            wrapper.__dict__.update(getattr(wrapped, '__dict__', {}))
            return wrapper

        return wrap
  #+end_src

  Walking through this, line by line.

  #+begin_src python
    def wraps(wrapped):
  #+end_src
  we have a function which returns a decorator.
  #+begin_src python
        def wrap(wrapper):
  #+end_src
  Here's the decorator we're returning. It wraps a wrapper.
  #+begin_src python
            for attr in ('__module__', '__name__', '__qualname__',
                         '__doc__', '__annotations__'):
  #+end_src
  These are all the attributes we want to conserve from the wrapped
  function in our new wrapper.
  #+begin_src python
                try:
                    val = getattr(wrapped, attr)
  #+end_src
  Try and get those attributes. If it fails, though:
  #+begin_src python
                except AttributeError:
                    pass
  #+end_src
  We don't set them, because they don't exist.
  #+begin_src python
                else:
                    setattr(wrapper, attr, val)
  #+end_src
  If they do exist, then set the wrapper's attributes to the
  corresponding values from the wrapped one.
  #+begin_src python
            wrapper.__dict__.update(getattr(wrapped, '__dict__', {}))
  #+end_src
  What's more, make sure the new function matches the old one's dict.
  #+begin_src python
            return wrapper
  #+end_src
  Return our wrapper from the actual decorator.
  #+begin_src python
        return wrap
  #+end_src
  Return the real decorator.
  
  So, recap on what you just learned. You can write decorators which
  decorate decorators which use Python meta-object facilities to
  modify functions to remain debuggable after decoration.
  
  And, as a funny example:
  #+begin_src python
    >>> @wraps(f)
    ... def f2():
    ...     return 10
    ... 
    >>> f2()
    10
    >>> f2.__name__
    'traced_fun'
  #+end_src
  Now we know it works.

  Also, you think I invented this ~@wraps~ thing? No, I stole it from the
  ~functools~ package. Look for ~update_wrapper~ and ~wraps~ in
  ~Lib/functools.py~ of the ~git@github.com:python/cpython~ repository
  to see more about it. In general, if you don't understand how
  something is implemented, go read the python source code!

  Now, let's get the (meta-)meta party started.  Did you think that
  decorators only applied to functions? I can't believe you would
  think something so un-meta.
  #+begin_src python
    def class_wrapper(class_to_be_wrapped):
        for key, val in vars(class_to_be_wrapped).items():
            if callable(val):
                setattr(class_to_be_wrapped, key, trace(val))
        return class_to_be_wrapped
  #+end_src
  This decorator applies the ~@trace~ decorator to each of the
  attributes of ~class_to_be_wrapped~ which can be called (implement
  the ~callable~ interface).
  #+begin_src python
    >>> @class_wrapper
    ... class TracedClass():
    ...     def __init__(self, test):
    ...             self.test = test
    ...     def some_method(self):
    ...             return self.test
    ... 
    >>> t = TracedClass("woah there pardner")
    Call -- (<__main__.TracedClass object at 0x7f2d8cdcce50>, 'woah there pardner'), {}
    >>> t.some_method()
    Call -- (<__main__.TracedClass object at 0x7f2d8cdcce50>,), {}
    'woah there pardner'
  #+end_src

