forbidden-knowledge.tex

\section{Function decorators (AKA functional programming from first principles)}
\label{sec:org07dfb20}
In Python, there exists something very cool called a function
decorator.

It looks like this:
\begin{verbatim}
@function_decorator
def f(something):
    return something
\end{verbatim}

What is it? It's something that can change the way your functions
behave without changing their bodies.

As for how it's actually implemented, it's a function which takes as
its argument another function, and returns a new function. The
original function is then defined as the new function returned by
the decorator.

What's the do-nothing decorator?
\begin{verbatim}
def do_nothing_dec(func):
    return func
\end{verbatim}
And, so, we can decorate a function by putting \texttt{@<decorator-name>}
before the function definition when defining it. It works in the
shell, too.
\begin{verbatim}
@do_nothing_dec
def f():
    return 5

>>> f()
5
\end{verbatim}

Cool. Let's make it even cooler. 
\begin{verbatim}
def add_five(func):
    return lambda: func() + 5
\end{verbatim}
Can you guess what this does to a function it decorates?
\begin{verbatim}
@add_five
def f():
    return 5

>>> f()
10
\end{verbatim}

But wait, I saw somewhere (I can't remember where) that decorators
can take arguments! Let's add that in.
\begin{verbatim}
def add_some(func, num):
    return lambda: func() + num 
\end{verbatim}
And, here we go!
\begin{verbatim}
>>> @add_some(4)
... def f():
...     return 5
... 
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
TypeError: add_some() missing 1 required positional argument: 'num'
\end{verbatim}

Huh? It didn't work. But, we know that \texttt{add\_some} works as we're
intending, it does return a function which behaves as expected.
\begin{verbatim}
>>> f()
10
>>> add_some(f, 4)
<function add_some.<locals>.<lambda> at 0x7f2d8cc8ae50>
>>> add_some(f, 4)()
14
\end{verbatim}

So, how is this supposed to work? We know that decorators can only
take one argument, the function they're applied to.

How do we pass arguments to a decorator?

(Pause for dramatic effect)

We create a function that returns a decorator.
\begin{verbatim}
def add_some(num):
    def add_other(func):
        return lambda: func() + num 
    return add_other
\end{verbatim}
Note how \texttt{add\_other} refers to \texttt{num}, which is not in its body.
This kind of function (which refers to variables outside of its
body) is called a \textbf{closure} (and is one of the most important things
you could learn, period. The power of closures is incredible.).
\begin{verbatim}
>>> @add_some(5)
... def f():
...     return 3
... 
>>> f()
8
\end{verbatim}
You can read this as \texttt{@(add\_some(5))}. It's evaluating \texttt{add\_some(5)}
before trying to use the result as a decorator.

What can you use it for? Let's say we had some complicated problem
with our recursive program that we couldn't figure out how to
solve. Every time you call it, it loops infinitely!

The boring way to debug that is adding print statements. The \emph{m e t
a} way of doing it is with decorators:
\begin{verbatim}
def trace(func):
    def traced_fun(*args, **kwargs):
        print(f"Call -- {args}, {kwargs}")
        return func(*args, *kwargs)
    return traced_fun
\end{verbatim}
So, let's annotate the function that we couldn't debug.
\begin{verbatim}
>>> @trace
... def f(a):
...     if a == 0:
...             return "you're done!"
...     else:
...             return f(a - 1)
\end{verbatim}
And the veil is removed from your eyes in real time!
\begin{verbatim}
>>> f(-1)
Call -- (-1,), {}
Call -- (-2,), {}
Call -- (-3,), {}
Call -- (-4,), {}
Call -- (-5,), {}
Call -- (-6,), {}
Call -- (-7,), {}
Call -- (-8,), {}
Call -- (-9,), {}
...
...
\end{verbatim}
Aha!
\begin{verbatim}
>>> f(5)
Call -- (5,), {}
Call -- (4,), {}
Call -- (3,), {}
Call -- (2,), {}
Call -- (1,), {}
Call -- (0,), {}
"you're done!"
\end{verbatim}

Alright, so our \emph{m e t a  t r a c e r} seems to work as
expected. But, you know what they say about leaky
abstractions. Sometimes things are not always what they seem.

\begin{verbatim}
>>> f.__name__
'traced_fun'
\end{verbatim}
What is this? \texttt{f}'s name is 'traced-fun'? That can't be right. Let's
cook up some more \emph{m e t a - o b j e c t} goodness.

Let's say we want the \texttt{traced\_fun} we're returning to have some of
the same attributes as the original functon that's passed. Let's
look at \texttt{f}.
\begin{verbatim}
>>> dir(f)
['__annotations__', '__call__', '__class__', '__closure__',
 '__code__', '__defaults__', '__delattr__', '__dict__', '__dir__',
 '__doc__', '__eq__', '__format__', '__ge__', '__get__',
 '__getattribute__', '__globals__', '__gt__', '__hash__', '__init__',
 '__init_subclass__', '__kwdefaults__', '__le__', '__lt__',
 '__module__', '__name__', '__ne__', '__new__', '__qualname__',
 '__reduce__', '__reduce_ex__', '__repr__', '__setattr__',
 '__sizeof__', '__str__', '__subclasshook__']
\end{verbatim}
Looks to me like we'd want \texttt{\_\_module\_\_}, \texttt{\_\_name\_\_}, \texttt{\_\_qualname\_\_},
\texttt{\_\_doc\_\_}, and \texttt{\_\_annotations\_\_} to stay the same after wrapping.

How shall we implement this, I hear you ask? Why, \emph{m e t a - f u n c
t i o n - d e c o r a t o r s}, of course!
\begin{verbatim}
def wraps(wrapped):
    def wrap(wrapper):
        for attr in ('__module__', '__name__', '__qualname__',
                     '__doc__', '__annotations__'):
            try:
                val = getattr(wrapped, attr)
            except AttributeError:
                pass
            else:
                setattr(wrapper, attr, val)
        wrapper.__dict__.update(getattr(wrapped, '__dict__', {}))
        return wrapper

    return wrap
\end{verbatim}

Walking through this, line by line.

\begin{verbatim}
def wraps(wrapped):
\end{verbatim}
we have a function which returns a decorator.
\begin{verbatim}
def wrap(wrapper):
\end{verbatim}
Here's the decorator we're returning. It wraps a wrapper.
\begin{verbatim}
for attr in ('__module__', '__name__', '__qualname__',
             '__doc__', '__annotations__'):
\end{verbatim}
These are all the attributes we want to conserve from the wrapped
function in our new wrapper.
\begin{verbatim}
try:
    val = getattr(wrapped, attr)
\end{verbatim}
Try and get those attributes. If it fails, though:
\begin{verbatim}
except AttributeError:
    pass
\end{verbatim}
We don't set them, because they don't exist.
\begin{verbatim}
else:
    setattr(wrapper, attr, val)
\end{verbatim}
If they do exist, then set the wrapper's attributes to the
corresponding values from the wrapped one.
\begin{verbatim}
wrapper.__dict__.update(getattr(wrapped, '__dict__', {}))
\end{verbatim}
What's more, make sure the new function matches the old one's dict.
\begin{verbatim}
return wrapper
\end{verbatim}
Return our wrapper from the actual decorator.
\begin{verbatim}
return wrap
\end{verbatim}
Return the real decorator.

So, recap on what you just learned. You can write decorators which
decorate decorators which use Python meta-object facilities to
modify functions to remain debuggable after decoration.

And, as a funny example:
\begin{verbatim}
>>> @wraps(f)
... def f2():
...     return 10
... 
>>> f2()
10
>>> f2.__name__
'traced_fun'
\end{verbatim}
Now we know it works.

Also, you think I invented this \texttt{@wraps} thing? No, I stole it from the
\texttt{functools} package. Look for \texttt{update\_wrapper} and \texttt{wraps} in
\texttt{Lib/functools.py} of the \texttt{git@github.com:python/cpython} repository
to see more about it. In general, if you don't understand how
something is implemented, go read the python source code!

Now, let's get the (meta-)meta party started.  Did you think that
decorators only applied to functions? I can't believe you would
think something so un-meta.
\begin{verbatim}
def class_wrapper(class_to_be_wrapped):
    for key, val in vars(class_to_be_wrapped).items():
        if callable(val):
            setattr(class_to_be_wrapped, key, trace(val))
    return class_to_be_wrapped
\end{verbatim}
This decorator applies the \texttt{@trace} decorator to each of the
attributes of \texttt{class\_to\_be\_wrapped} which can be called (implement
the \texttt{callable} interface).
\begin{verbatim}
>>> @class_wrapper
... class TracedClass():
...     def __init__(self, test):
...             self.test = test
...     def some_method(self):
...             return self.test
... 
>>> t = TracedClass("woah there pardner")
Call -- (<__main__.TracedClass object at 0x7f2d8cdcce50>, 'woah there pardner'), {}
>>> t.some_method()
Call -- (<__main__.TracedClass object at 0x7f2d8cdcce50>,), {}
'woah there pardner'
\end{verbatim}
