forbidden-knowledge.org
* The problem with interpretation
  So, we've gathered that the internals of python are implemented
  largely using python data structures. What does this tell us?

  - we can do almost nothing in the language without having to lookup
    a key in a dictionary, at the very least. A method call involves a
    lookup, a function call often involves the consing of various data
    structures (especially tuples. Did you know that tuples are stored
    on the heap, not the stack? Of course you did, everything is on
    the heap). Every single time ~.~ is used, a lookup is done in some
    dictionary.
  - Because the language semantics are implemented with these data
    structures (as opposed to, say, vtables in C++, and similar things
    in other similarly object oriented languages), you're never
    going to escape a certain slow speed at which you're doing
    anything. Most of the best applications for python are thin
    wrappers over top of other libraries to get out of the python
    speed trap (ML, scientific computing) (and, also to reuse existing
    codebases. Isn't it nice that python has this C API that is easy
    to program to?).
  
* A meta-object application (-> meta-app -> metapp)
  Let's take advantage of some of these newfangled python features to
  write something interesting. 
  
  With the help of a handful of miracles, we're going to write a lisp
  interpreter. In particular, we're going to write a Scheme
  interpreter. Scheme is a small and simple, but very powerful
  language.

  Let's talk about some of the components of our interpreter.

** Data types
   Scheme uses a handful of data types that we'll need to implement.
   
   - Booleans (we're going to use ~True~ and ~False~ for this)
   - Numbers (we're going to hack together python's number system)
   - Characters (we're going to use python single-character strings)
   - Strings (python strings)
   - Symbols (python strings)
   - Pairs and lists (python tuples and lists)
   - Vectors (python lists)
   - Procedures (python object)

** Expressions
   In scheme, most things are /expressions/ evaluated to produce a
   /value/ in some environment. (or more than one value)

   There are literal expressions, such as ~#t~, or any number.
   
   There are also compound expressions, which are composed of a pair
   of parenthese around sub-expressions. The first subexpression is an
   operation, the rest of the subexpressions are operands.
   
*** Let's be pedantic about expressions for a sec.
    When you see a form such as ~(a b c)~, you're seeing an s-exp, or
    s-expression, or symbol-expression. These are commonly called
    "Forms". Forms are the superset composed of expressions,
    definitions, so-called "special forms", etc.
   
** Environment and binding
   In scheme, there exist variables (gasp) which refer to values. We
   can bind variables using a ~let~ expression. Those variables are
   then bound in that let expression. The variables in the let
   expression are local.

** Definitions
   It is also possible to define global variables with a
   ~define~. ~define~ creates what is called a 'top-level'
   definition. ~define~ forms are /definitions/, not
   expressions. They can't appear in the places that a normal variable
   can.

** Procedures
   We can implement the procedures as python callable objects, and
   have their call be equivalent to the evaluation of the function
   body with the arguments bound.
   
* Alright, we have enough to implement a first try at the interpreter.
  We're going to need some way to parse the forms. Let's split it in
  two. First, we're going to split the input into tokens with some
  clever python hacks, and then we're going to parse the tokens into a
  tree.
  
  We use python's ~split~ to actually split the string, which saves us
  a metric ton of effort.
  #+BEGIN_SRC python
    def tokenize(text):
        return text.replace('(', ' ( ')\
                   .replace(')', ' ) ')\
                   .replace("'", " ' ")\
                   .split()
  #+END_SRC
  
  Afterwards, we use a simple recursive thing to turn it into a list
  structure.
  #+BEGIN_SRC python
    def treeify(tokens):
        return treeify_aux(tokens)[1]
    
    # goes from tokens to a python list 
    def treeify_aux(tokens, i=0, sublist=False):
        done = False
        acc = []
        while i < len(tokens):
            if tokens[i] == '(':
                i, res = treeify_aux(tokens, i + 1, True)
                acc.append(res)
            elif tokens[i] == ')':
                if not sublist:
                    raise Exception(f"unmatched close-paren at token index {i}")
                else:
                    return (i + 1, acc)
            else:
                acc.append(sym(tokens[i]))
                i += 1
    
        if not sublist:
            return (i, acc)
        else:
            raise Exception(f"unbalanced open-paren")

    def sym(s):
        try:
            return int(s)
        except ValueError:
            try:
                return float(s)
            except ValueError:
                return s # this is a string
  #+END_SRC

  Let's test it out.
  #+BEGIN_SRC python
    >>> tokenize("(define (F a) (+ a a))")
    ['(', 'define', '(', 'F', 'a', ')', '(', '+', 'a', 'a', ')', ')']

    >>> treeify(tokenize("(define (F a) (+ a a)) (let ((x 2)) (+ x x))"))
    [['define', ['F', 'a'], 
                ['+', 'a', 'a']], 
     ['let', [['x', '2']], 
             ['+', 'x', 'x']]]
  #+END_SRC
  I added some indentation to the second example to make it a bit
  easier to read.
  
** What's in an environment?
   When we have a symbol whose binding we want to access, we first look
   at the current lexical scope, then at the set of definitions.
   
   The lexical scope is a linked list of dictionaries, (a stack,
   effectively) which represent the bindings that are present in
   scope. We start from the top of the stack, and go downwards,
   returning the first match we find. 
   
   (define) works by modifying the global scope.
   
   #+begin_src python
     import operator as op
     import math
     # an Environment is nothing but a mapping from keys to values which
     # has an outer sccope
     class Env(dict):
         def __init__(self, init={}, outer=None):
             self.update(init)
             self.outer = outer
             # return the env which contains this key
         def find(self, key):
             return self if (key in self) else\
                 (self.outer.find(key) if self.outer else None)
 
     global_env = Env({
         '+': op.add, '-':op.sub, '*':op.mul, '/':op.truediv,
         '>':op.gt, '<':op.lt, '>=':op.ge, '<=':op.le, '=':op.eq,
         'abs':     abs,
         'append':  op.add,
         'apply':   lambda f, args: f(*args),
         'begin':   lambda *x: x[-1],
         'car':     lambda x: x[0],
         'cdr':     lambda x: x[1:],
         'cons':    lambda x,y: [x] + y,
         'eq?':     op.is_,
         'equal?':  op.eq,
         'length':  len,
         'list':    lambda *x: list(x),
         'list?':   lambda x: isinstance(x,list),
         'map':     map,
         'max':     max,
         'min':     min,
         'not':     op.not_,
         'null?':   lambda x: x == [],
         'number?': lambda x: isinstance(x, Number),
         'procedure?': callable,
         'round':   round,
         'symbol?': lambda x: isinstance(x, Symbol),
     })
     global_env.update(filter(lambda x: x[0].find('__') == -1, vars(math).items()))
   #+end_src
   
   Here we define all the most important scheme procedures.
  
