forbidden-knowledge.tex

\subsection{What's in a procedure?}
\label{sec:org216c97b}
\begin{verbatim}
class Proc(object):
    def __init__(self, args, body, env, name="lambda"):
        self.args = args
        self.body = body
        self.env = env # This is for closures
        self.__name__ = name
    def __call__(self, *args):
        if len(args) != len(self.args):
            raise Exception("Bad # of arguments passed to ")
        e = Env(dict(zip(self.args, args)), self.env)
        print('body', self.body)
        return [tar(x, e) for x in self.body][-1]
\end{verbatim}
\end{document}